БИТУправление_медицинским_центром_демо/src/Documents/РаботыПоРекламации/РаботыПоРекламации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаботыПоРекламации</name>
  <registerRecords>InformationRegister.СписанныеТовары</registerRecords>
  <registerRecords>AccumulationRegister.РасходМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМатериалов</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекламация</name>
    <type>
      <types>DocumentRef.Рекламация</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>DocumentRef.Прием</types>
      <types>CatalogRef.Клиенты</types>
      <types>DocumentRef.Рекламация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычитатьИзВыработкиВиновника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтрокиРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/Рекламация/Рекламация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рекламация</name>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметРекламации</name>
    <type>
      <types>DefinedType.ПредметРекламации</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительНовый</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/РаботыПоРекламации/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет или дополняет материалы по нормам работ
//
// Параметры:
//  Объект						 - ДокументОбъект.РаботыПоРекламации - заполняемый документ.
//  СтруктураДополняющейРаботы	 - Структура - описание добавленной работы
//
Процедура ЗаполнитьМатериалыПоНормамРабот(Объект, СтруктураДополняющейРаботы = Неопределено) Экспорт
	
	сзСписокРабот = Новый СписокЗначений;
	сзСписокХарактеристикНоменклатуры = Новый СписокЗначений;
	
	ТаблицаРабот = Объект.Работы.Выгрузить();
	
	Если СтруктураДополняющейРаботы = Неопределено Тогда
		Объект.Материалы.Очистить();	
		Если ТаблицаРабот.Количество() = 0 Тогда Возврат КонецЕсли;
		
		сзСписокРабот.ЗагрузитьЗначения(ТаблицаРабот.ВыгрузитьКолонку("Номенклатура"));
		сзСписокХарактеристикНоменклатуры.ЗагрузитьЗначения(ТаблицаРабот.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	Иначе
		сзСписокРабот.Добавить(СтруктураДополняющейРаботы.Номенклатура);		
		сзСписокХарактеристикНоменклатуры.Добавить(СтруктураДополняющейРаботы.ХарактеристикаНоменклатуры);
	КонецЕсли;
	
	сзСписокХарактеристикНоменклатуры.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	
	ТаблицаРабот.Колонки.Добавить("кНомерСтроки",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)));
	Для Каждого СтрокаТаблицы Из ТаблицаРабот Цикл
		СтрокаТаблицы.кНомерСтроки = СтрокаТаблицы.НомерСтроки;
	КонецЦикла;
	
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
		Если ЗначениеЗаполнено(СтрокаРаботы.ХарактеристикаНоменклатуры) Тогда
			СтрокаТаблицы = ТаблицаРабот.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрокаРаботы);
			СтрокаТаблицы.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			СтрокаТаблицы.кНомерСтроки = СтрокаТаблицы.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаМатериалов = Объект.Материалы.Выгрузить();
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Объект);
	РаботаСДокументамиСервер.ЗаполнитьРасходМатериаловПоНормамНаРаботы(ТаблицаРабот, ТаблицаМатериалов, СтруктураШапкиДокумента);	
	
	ТаблицаМатериалов.Свернуть("КлючСтрокиРаботы, Работа, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена", "Количество, Сумма");
	Объект.Материалы.Загрузить(ТаблицаМатериалов);
	
КонецПроцедуры

// Перезаполнить работы по рекламации-основанию.
//
// Параметры:
//  Объект				 - ДокументОбъект.РаботыПоРекламации - заполняемый документ.
//  ЗаполнятьМатериалы	 - Булево							 - следует ли перезаполнить табличную часть материалов.
//
Процедура ПерезаполнитьРаботыПоРекламации(Объект, ЗаполнятьМатериалы = Истина) Экспорт
	
	Объект.Работы.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.Рекламация) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РекламацияРаботы.Ссылка,
	|	РекламацияРаботы.НомерСтроки КАК КлючСтроки,
	|	РекламацияРаботы.Номенклатура,
	|	РекламацияРаботы.ХарактеристикаНоменклатуры,
	|	РекламацияРаботы.Количество,
	|	РекламацияРаботы.Цена,
	|	РекламацияРаботы.Сумма,
	|	РекламацияРаботы.СуммаБезСкидок
	|ИЗ
	|	Документ.Рекламация.Работы КАК РекламацияРаботы
	|ГДЕ
	|	РекламацияРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Рекламация);
	
	Объект.Работы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЗаполнятьМатериалы Тогда 
		ЗаполнитьМатериалыПоНормамРабот(Объект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
